Revit 2024 API
TextNode.IsTransparent Property
 Indicates whether the text background is transparent or opaque.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsTransparent { get; }
Visual Basic
Public ReadOnly Property IsTransparent As Boolean
	Get
Visual C++
public:
property bool IsTransparent {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace